# Лопатін Євген домашка модулю 3
# завдання 3 (необов'язкове)
# Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' та додаючи +38 де потрібно

import re  # імортуємо модуль re

def normalize_phone(phone_number):  # створюємо функцію
    phone_number = re.sub(r'[^\d+]', '', phone_number)  # Видаляємо всі нецифрофі символи за виключеннями символу '+'
  
    if not phone_number.startswith('+'):   # Додаємо код України '+38' у случаях відсутності
        if phone_number.startswith('380'):
            phone_number = '+' + phone_number
        else:
            phone_number = '+38' + phone_number

    return phone_number

# приклад роботи функції, наш неформатний список:
raw_numbers = [
    "067\\г123 4567",
    "(095) !234-5678\\n",
    "+380 44 123 4567",
    "380501234567",
    "    +38(050)123-32-34",
    "     0503451234",
    "(050)888з9900",
    "38050-111-22-22",
    "38050 111 22 11   ",
]

sanitized_numbers = [normalize_phone(num) for num in raw_numbers] # Застосовуємо функцію до чисел неформатного списка
print("Нормалізовані номери телефонів для SMS-розсилки:", sanitized_numbers) # Виводимо форматований результат на екран терміналу